OpenFOAM-v2506/tutorials/verificationAndValidation/atmosphericModels/atmFlatTerrain/precursor/setups.orig/common/0.orig/LAD
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      LAD;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    "(bottom|top)"
    {
        type            fixedValue;
        value           uniform 0;
    }

    "(inlet|outlet|left|right)"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
